#include"BackGround.h"
#include<iostream>

void backGround_01() {
	cout << "\n";
	cout << "================================\n";
	cout << "            垓下大帐\n";
	cout << "================================\n";
}
void backGround_02() {
	cout << "\n";
	cout << "================================\n";
	cout << "              淮河\n";
	cout << "================================\n";
}
void backGround_03() {
	cout << "\n";
	cout << "================================\n";
	cout << "              东城\n";
	cout << "================================\n";
}
void backGround_04() {
	cout << "\n";
	cout << "================================\n";
	cout << "              乌江\n";
	cout << "================================\n";
}
